Revit 2026 API

# ConnectorCoordinateSystem Property

---

The coordinate system of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Transform CoordinateSystem { get; }
```
```vb
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
```
```cpp
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
```
```fsharp
abstract CoordinateSystem : Transform with get
override CoordinateSystem : Transform with get
```

#### Property Value

Transform

#### Implements

IConnectorCoordinateSystem

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector is of logical type. |
| InvalidOperationException | Thrown on failure to get coordinate system. |

The coordinate system's origin is the location of the connector and the Z-axis is normal to the connector.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace